Emanuel2023/EmanuelsProjects/MKL25Z4_Project_WirelessCountdownSystemProject/source/RF24.c
//               radio->address_width) &&
//           RF24_WriteRegisterBuffer(
//               radio,
//               NRF24_TX_ADDR,
//               address,
//               radio->address_width);
//}
//
//bool RF24_OpenReadingPipe(
//    RF24_t *radio,
//    uint8_t pipe,
//    const uint8_t *address)
//{
//    uint8_t en_rxaddr = 0U;
//
//    if ((radio == NULL) ||
//        (address == NULL) ||
//        (pipe > 5U)) {
//        return false;
//    }
//
//    if (pipe == 0U) {
//        memcpy(
//            radio->pipe0_reading_address,
//            address,
//            radio->address_width);
//        radio->pipe0_is_receiving = true;
//    }
//
//    if (pipe < 2U) {
//        if (!RF24_WriteRegisterBuffer(
//                radio,
//                s_child_pipe_address[pipe],
//                address,
//                radio->address_width)) {
//            return false;
//        }
//    } else {
//        if (!RF24_WriteRegisterByte(
//                radio,
//                s_child_pipe_address[pipe],
//                address[0])) {
//            return false;
//        }
//    }
//
//    if (!RF24_WriteRegisterByte(
//            radio,
//            s_child_payload_size[pipe],
//            radio->payload_size) ||
//        !RF24_ReadRegisterByte(
//            radio,
//            NRF24_EN_RXADDR,
//            &en_rxaddr)) {
//        return false;
//    }
//
//    en_rxaddr |= RF24_BIT(s_child_pipe_enable[pipe]);
//
//    return RF24_WriteRegisterByte(
//        radio,
//        NRF24_EN_RXADDR,
//        en_rxaddr);
//}
//
//bool RF24_CloseReadingPipe(RF24_t *radio, uint8_t pipe)
//{
//    uint8_t en_rxaddr = 0U;
//
//    if ((radio == NULL) ||
//        (pipe > 5U) ||
//        !RF24_ReadRegisterByte(
//            radio,
//            NRF24_EN_RXADDR,
//            &en_rxaddr)) {
//        return false;
//    }
//
//    en_rxaddr &= (uint8_t)~RF24_BIT(s_child_pipe_enable[pipe]);
//
//    if (pipe == 0U) {
//        radio->pipe0_is_receiving = false;
//    }
//
//    return RF24_WriteRegisterByte(
//        radio,
//        NRF24_EN_RXADDR,
//        en_rxaddr);
//}
//
///* -------------------------------------------------------------------------- */
///* Power and operating modes                                                  */
///* -------------------------------------------------------------------------- */
//
//bool RF24_PowerUp(RF24_t *radio)
//{
//    if (radio == NULL) {
//        return false;
//    }
//
//    if ((radio->config_register & RF24_BIT(NRF24_PWR_UP)) == 0U) {
//        radio->config_register |= RF24_BIT(NRF24_PWR_UP);
//
//        if (!RF24_WriteRegisterByte(
//                radio,
//                NRF24_CONFIG,
//                radio->config_register)) {
//            return false;
//        }
//
//        RF24_DelayUs(RF24_POWERUP_DELAY_US);
//    }
//
//    return true;
//}
//
//bool RF24_PowerDown(RF24_t *radio)
//{
//    if (radio == NULL) {
//        return false;
//    }
//
//    RF24_CE_Low();
//
//    radio->config_register &=
//        (uint8_t)~RF24_BIT(NRF24_PWR_UP);
//
//    return RF24_WriteRegisterByte(
//        radio,
//        NRF24_CONFIG,
//        radio->config_register);
//}
//
//bool RF24_StartListening(RF24_t *radio)
//{
//    if ((radio == NULL) ||
//        !RF24_PowerUp(radio)) {
//        return false;
//    }
//
//    radio->config_register |= RF24_BIT(NRF24_PRIM_RX);
//
//    if (!RF24_WriteRegisterByte(
//            radio,
//            NRF24_CONFIG,
//            radio->config_register) ||
//        !RF24_WriteRegisterByte(
//            radio,
//            NRF24_STATUS,
//            RF24_IRQ_ALL)) {
//        return false;
//    }
//
//    if (radio->pipe0_is_receiving) {
//        if (!RF24_WriteRegisterBuffer(
//                radio,
//                NRF24_RX_ADDR_P0,
//                radio->pipe0_reading_address,
//                radio->address_width)) {
//            return false;
//        }
//    } else {
//        if (!RF24_CloseReadingPipe(radio, 0U)) {
//            return false;
//        }
//    }
//
//    RF24_CE_High();
//    return true;
//}
//
//bool RF24_StopListening(RF24_t *radio)
//{
//    uint8_t en_rxaddr = 0U;
//
//    if (radio == NULL) {
//        return false;
//    }
//
//    RF24_CE_Low();
//    RF24_DelayUs(radio->tx_delay_us);
//
//    if (radio->ack_payloads_enabled) {
//        (void)RF24_FlushTx(radio);
//    }
//
//    radio->config_register &=
//        (uint8_t)~RF24_BIT(NRF24_PRIM_RX);
//
//    if (!RF24_WriteRegisterByte(
//            radio,
//            NRF24_CONFIG,
//            radio->config_register) ||
//        !RF24_WriteRegisterBuffer(
//            radio,
//            NRF24_RX_ADDR_P0,
//            radio->pipe0_writing_address,
//            radio->address_width) ||
//        !RF24_ReadRegisterByte(
//            radio,
//            NRF24_EN_RXADDR,
//            &en_rxaddr)) {
//        return false;
//    }
//
//    en_rxaddr |= RF24_BIT(NRF24_ERX_P0);
//
//    return RF24_WriteRegisterByte(
//        radio,
//        NRF24_EN_RXADDR,
//        en_rxaddr);
//}
//
///* -------------------------------------------------------------------------- */
///* TX/RX                                                                      */
///* -------------------------------------------------------------------------- */
//
//bool RF24_Available(RF24_t *radio)
//{
//    uint8_t status;
//
//    if (radio == NULL) {
//        return false;
//    }
//
//    status = RF24_UpdateStatus(radio);
//    return ((status >> NRF24_RX_P_NO) & 0x07U) < 6U;
//}
//
//bool RF24_AvailablePipe(
//    RF24_t *radio,
//    uint8_t *pipe_number)
//{
//    uint8_t status;
//    uint8_t pipe;
//
//    if (radio == NULL) {
//        return false;
//    }
//
//    status = RF24_UpdateStatus(radio);
//    pipe = (uint8_t)((status >> NRF24_RX_P_NO) & 0x07U);
//
//    if (pipe_number != NULL) {
//        *pipe_number = pipe;
//    }
//
//    return pipe < 6U;
//}
//
//bool RF24_Read(
//    RF24_t *radio,
//    void *buffer,
//    uint8_t length)
//{
//    if ((radio == NULL) ||
//        !RF24_ReadPayloadInternal(radio, buffer, length)) {
//        return false;
//    }
//
//    return RF24_WriteRegisterByte(
//        radio,
//        NRF24_STATUS,
//        RF24_BIT(NRF24_RX_DR));
//}
//
//uint8_t RF24_GetDynamicPayloadSize(RF24_t *radio)
//{
//    uint8_t width = 0U;
//    uint8_t status = 0xFFU;
//
//    if (radio == NULL) {
//        return 0U;
//    }
//
//    RF24_BeginTransaction();
//
//    if (!RF24_TransferByte(NRF24_R_RX_PL_WID, &status) ||
//        !RF24_TransferByte(NRF24_NOP, &width)) {
//        RF24_EndTransaction();
//        return 0U;
//    }
//
//    RF24_EndTransaction();
//    radio->status = status;
//
//    if (width > RF24_MAX_PAYLOAD_SIZE) {
//        (void)RF24_FlushRx(radio);
//        RF24_DelayMs(2U);
//        return 0U;
//    }
//
//    return width;
//}
//
//bool RF24_StartFastWrite(
//    RF24_t *radio,
//    const void *buffer,
//    uint8_t length,
//    bool no_ack,
//    bool start_tx)
//{
//    uint8_t command;
//
//    if (radio == NULL) {
//        return false;
//    }
//
//    command = no_ack
//        ? NRF24_W_TX_PAYLOAD_NO_ACK
//        : NRF24_W_TX_PAYLOAD;
//
//    if (!RF24_WritePayloadInternal(
//            radio,
//            buffer,
//            length,
//            command)) {
//        return false;
//    }
//
//    if (start_tx) {
//        RF24_CE_High();
//    }
//
//    return true;
//}
//
//bool RF24_Write(
//    RF24_t *radio,
//    const void *buffer,
//    uint8_t length)
//{
//    return RF24_WriteNoAck(radio, buffer, length, false);
//}
//
//bool RF24_WriteNoAck(
//    RF24_t *radio,
//    const void *buffer,
//    uint8_t length,
//    bool no_ack)
//{
//    bool wait_ok;
//
//    if (radio == NULL) {
//        return false;
//    }
//
//    if (!RF24_StartFastWrite(
//            radio,
//            buffer,
//            length,
//            no_ack,
//            true)) {
//        return false;
//    }
//
//    wait_ok = RF24_WaitForTransmitResult(
//        radio,
//        RF24_DEFAULT_TX_TIMEOUT_MS);
//
//    RF24_CE_Low();
//
//    if (!wait_ok) {
//        return false;
//    }
//
//    (void)RF24_ClearStatusFlags(radio, RF24_IRQ_ALL);
//
//    if ((radio->status & RF24_IRQ_TX_FAILED) != 0U) {
//        (void)RF24_FlushTx(radio);
//        return false;
//    }
//
//    return true;
//}
//
//bool RF24_WriteAckPayload(
//    RF24_t *radio,
//    uint8_t pipe,
//    const void *buffer,
//    uint8_t length)
//{
//    if ((radio == NULL) ||
//        (pipe > 5U) ||
//        !radio->ack_payloads_enabled) {
//        return false;
//    }
//
//    return RF24_WritePayloadInternal(
//        radio,
//        buffer,
//        length,
//        (uint8_t)(NRF24_W_ACK_PAYLOAD | (pipe & 0x07U)));
//}
//
//bool RF24_RxFifoFull(RF24_t *radio)
//{
//    uint8_t fifo = 0U;
//
//    if ((radio == NULL) ||
//        !RF24_ReadRegisterByte(
//            radio,
//            NRF24_FIFO_STATUS,
//            &fifo)) {
//        return false;
//    }
//
//    return (fifo & RF24_BIT(NRF24_RX_FULL)) != 0U;
//}
//
//RF24_FifoState_t RF24_GetFifoState(
//    RF24_t *radio,
//    bool tx_fifo)
//{
//    uint8_t fifo = 0U;
//    bool full;
//    bool empty;
//
//    if ((radio == NULL) ||
//        !RF24_ReadRegisterByte(
//            radio,
//            NRF24_FIFO_STATUS,
//            &fifo)) {
//        return RF24_FIFO_INVALID;
//    }
//
//    if (tx_fifo) {
//        full = (fifo & RF24_BIT(NRF24_FIFO_FULL)) != 0U;
//        empty = (fifo & RF24_BIT(NRF24_TX_EMPTY)) != 0U;
//    } else {
//        full = (fifo & RF24_BIT(NRF24_RX_FULL)) != 0U;
//        empty = (fifo & RF24_BIT(NRF24_RX_EMPTY)) != 0U;
//    }
//
//    if (full && empty) {
//        return RF24_FIFO_INVALID;
//    }
//
//    if (full) {
//        return RF24_FIFO_FULL;
//    }
//
//    if (empty) {
//        return RF24_FIFO_EMPTY;
//    }
//
//    return RF24_FIFO_OCCUPIED;
//}
//
///* -------------------------------------------------------------------------- */
///* Carrier detection and diagnostics                                          */
///* -------------------------------------------------------------------------- */
//
//bool RF24_TestCarrier(RF24_t *radio)
//{
//    uint8_t rpd = 0U;
//
//    if ((radio == NULL) ||
//        !RF24_ReadRegisterByte(radio, NRF24_RPD, &rpd)) {
//        return false;
//    }
//
//    return (rpd & 0x01U) != 0U;
//}
//
//bool RF24_IsPlusVariant(const RF24_t *radio)
//{
//    return (radio != NULL) && radio->is_plus_variant;
//}
//
//uint8_t RF24_GetARC(RF24_t *radio)
//{
//    uint8_t observe = 0U;
//
//    if ((radio == NULL) ||
//        !RF24_ReadRegisterByte(
//            radio,
//            NRF24_OBSERVE_TX,
//            &observe)) {
//        return 0U;
//    }
//
//    return (uint8_t)(observe & 0x0FU);
//}



















#include "RF24.h"
#include "RF24_config.h"
#include "nRF24L01.h"
#include "fsl_debug_console.h"

#include <string.h>

