Emanuel2023/EmanuelsProjects/MKL25Z4_Project_WirelessCountdownSystemProject/source/RF24.c
/* -------------------------------------------------------------------------- */
/* Local constants                                                            */
/* -------------------------------------------------------------------------- */

#define RF24_MAX_CHANNEL              125U
#define RF24_DEFAULT_CHANNEL          76U
#define RF24_DEFAULT_RETRY_DELAY      5U
#define RF24_DEFAULT_RETRY_COUNT      15U
#define RF24_DEFAULT_TX_TIMEOUT_MS    95U

#define RF24_STATUS_IRQ_MASK \
    ((uint8_t)(RF24_BIT(NRF24_MASK_MAX_RT) | \
               RF24_BIT(NRF24_TX_DS)       | \
               RF24_BIT(NRF24_RX_DR)))

static const uint8_t s_child_pipe_enable[6] = {
    NRF24_ERX_P0,
    NRF24_ERX_P1,
    NRF24_ERX_P2,
    NRF24_ERX_P3,
    NRF24_ERX_P4,
    NRF24_ERX_P5
};

static const uint8_t s_child_pipe_address[6] = {
    NRF24_RX_ADDR_P0,
    NRF24_RX_ADDR_P1,
    NRF24_RX_ADDR_P2,
    NRF24_RX_ADDR_P3,
    NRF24_RX_ADDR_P4,
    NRF24_RX_ADDR_P5
};

static const uint8_t s_child_payload_size[6] = {
    NRF24_RX_PW_P0,
    NRF24_RX_PW_P1,
    NRF24_RX_PW_P2,
    NRF24_RX_PW_P3,
    NRF24_RX_PW_P4,
    NRF24_RX_PW_P5
};

/* -------------------------------------------------------------------------- */
/* Low-level helpers                                                          */
/* -------------------------------------------------------------------------- */

static void RF24_BeginTransaction(void)
{
    RF24_CSN_Low();
}

static void RF24_EndTransaction(void)
{
    RF24_CSN_High();
}

static bool RF24_TransferByte(uint8_t tx, uint8_t *rx)
{
    uint8_t received = 0xFFU;
    bool ok = RF24_SPI_TransferByte(tx, &received);

    if (rx != NULL) {
        *rx = received;
    }

    return ok;
}

static bool RF24_Command(RF24_t *radio, uint8_t command)
{
    uint8_t status = 0xFFU;

    if (radio == NULL) {
        return false;
    }

    RF24_BeginTransaction();
    bool ok = RF24_TransferByte(command, &status);
    RF24_EndTransaction();

    radio->status = status;
    return ok;
}

static bool RF24_ReadRegisterBuffer(
    RF24_t *radio,
    uint8_t reg,
    uint8_t *buffer,
    uint8_t length)
{
    uint8_t status = 0xFFU;

    if ((radio == NULL) || ((buffer == NULL) && (length > 0U))) {
        return false;
    }

    RF24_BeginTransaction();

    if (!RF24_TransferByte((uint8_t)(NRF24_R_REGISTER | (reg & NRF24_REGISTER_MASK)),
                           &status)) {
        RF24_EndTransaction();
        return false;
    }

    radio->status = status;

    for (uint8_t i = 0U; i < length; ++i) {
        if (!RF24_TransferByte(NRF24_NOP, &buffer[i])) {
            RF24_EndTransaction();
            return false;
        }
    }

    RF24_EndTransaction();
    return true;
}

static bool RF24_ReadRegisterByte(
    RF24_t *radio,
    uint8_t reg,
    uint8_t *value)
{
    return RF24_ReadRegisterBuffer(radio, reg, value, 1U);
}

static bool RF24_WriteRegisterBuffer(
    RF24_t *radio,
    uint8_t reg,
    const uint8_t *buffer,
    uint8_t length)
{
    uint8_t status = 0xFFU;
    uint8_t ignored = 0U;

    if ((radio == NULL) || ((buffer == NULL) && (length > 0U))) {
        return false;
    }

    RF24_BeginTransaction();

    if (!RF24_TransferByte(
            (uint8_t)(NRF24_W_REGISTER | (reg & NRF24_REGISTER_MASK)),
            &status)) {
        RF24_EndTransaction();
        return false;
    }

    radio->status = status;

    for (uint8_t i = 0U; i < length; ++i) {
        if (!RF24_TransferByte(buffer[i], &ignored)) {
            RF24_EndTransaction();
            return false;
        }
    }

    RF24_EndTransaction();
    return true;
}

static bool RF24_WriteRegisterByte(
    RF24_t *radio,
    uint8_t reg,
    uint8_t value)
{
    return RF24_WriteRegisterBuffer(radio, reg, &value, 1U);
}

static bool RF24_WritePayloadInternal(
    RF24_t *radio,
    const void *buffer,
    uint8_t data_length,
    uint8_t command)
{
    const uint8_t *current = (const uint8_t *)buffer;
    uint8_t status = 0xFFU;
    uint8_t ignored = 0U;
    uint8_t blank_length = 0U;

    if ((radio == NULL) || ((buffer == NULL) && (data_length > 0U))) {
        return false;
    }

    if (radio->dynamic_payloads_enabled) {
        data_length = RF24_MIN(data_length, RF24_MAX_PAYLOAD_SIZE);
    } else {
        data_length = RF24_MIN(data_length, radio->payload_size);
        blank_length = (uint8_t)(radio->payload_size - data_length);
    }

    RF24_BeginTransaction();

    if (!RF24_TransferByte(command, &status)) {
        RF24_EndTransaction();
        return false;
    }

    radio->status = status;

    for (uint8_t i = 0U; i < data_length; ++i) {
        if (!RF24_TransferByte(current[i], &ignored)) {
            RF24_EndTransaction();
            return false;
        }
    }

    for (uint8_t i = 0U; i < blank_length; ++i) {
        if (!RF24_TransferByte(0U, &ignored)) {
            RF24_EndTransaction();
            return false;
        }
    }

    RF24_EndTransaction();
    return true;
}

static bool RF24_ReadPayloadInternal(
    RF24_t *radio,
    void *buffer,
    uint8_t data_length)
{
    uint8_t *current = (uint8_t *)buffer;
    uint8_t status = 0xFFU;
    uint8_t ignored = 0U;
    uint8_t blank_length = 0U;

    if ((radio == NULL) || ((buffer == NULL) && (data_length > 0U))) {
        return false;
    }

    if (radio->dynamic_payloads_enabled) {
        data_length = RF24_MIN(data_length, RF24_MAX_PAYLOAD_SIZE);
    } else {
        data_length = RF24_MIN(data_length, radio->payload_size);
        blank_length = (uint8_t)(radio->payload_size - data_length);
    }

    RF24_BeginTransaction();

    if (!RF24_TransferByte(NRF24_R_RX_PAYLOAD, &status)) {
        RF24_EndTransaction();
        return false;
    }

    radio->status = status;

    for (uint8_t i = 0U; i < data_length; ++i) {
        if (!RF24_TransferByte(NRF24_NOP, &current[i])) {
            RF24_EndTransaction();
            return false;
        }
    }

    for (uint8_t i = 0U; i < blank_length; ++i) {
        if (!RF24_TransferByte(NRF24_NOP, &ignored)) {
            RF24_EndTransaction();
            return false;
        }
    }

    RF24_EndTransaction();
    return true;
}

static bool RF24_ToggleFeatures(RF24_t *radio)
{
    uint8_t status = 0xFFU;
    uint8_t ignored = 0U;

    if (radio == NULL) {
        return false;
    }

    RF24_BeginTransaction();

