Emanuel2023/EmanuelsProjects/MKL25Z4_Project_WirelessCountdownSystemProject/source/RF24.c
    if (!RF24_TransferByte(NRF24_ACTIVATE, &status)) {
        RF24_EndTransaction();
        return false;
    }

    radio->status = status;

    if (!RF24_TransferByte(0x73U, &ignored)) {
        RF24_EndTransaction();
        return false;
    }

    RF24_EndTransaction();
    return true;
}

static uint8_t RF24_GetDataRateRegisterValue(RF24_DataRate_t speed)
{
    switch (speed) {
        case RF24_DATA_RATE_250KBPS:
            return RF24_BIT(NRF24_RF_DR_LOW);

        case RF24_DATA_RATE_2MBPS:
            return RF24_BIT(NRF24_RF_DR_HIGH);

        case RF24_DATA_RATE_1MBPS:
        default:
            return 0U;
    }
}

static uint8_t RF24_GetPALevelRegisterValue(
    RF24_PALevel_t level,
    bool lna_enable)
{
    uint8_t value;

    switch (level) {
        case RF24_PA_MIN:
            value = 0U;
            break;

        case RF24_PA_LOW:
            value = RF24_BIT(NRF24_RF_PWR_LOW);
            break;

        case RF24_PA_HIGH:
            value = RF24_BIT(NRF24_RF_PWR_HIGH);
            break;

        case RF24_PA_MAX:
        default:
            value = (uint8_t)(RF24_BIT(NRF24_RF_PWR_LOW) |
                              RF24_BIT(NRF24_RF_PWR_HIGH));
            break;
    }

    if (lna_enable) {
        value |= RF24_BIT(NRF24_LNA_HCURR);
    }

    return value;
}

static bool RF24_WaitForTransmitResult(
    RF24_t *radio,
    uint32_t timeout_ms)
{
    uint32_t start;

    if (radio == NULL) {
        return false;
    }

    start = RF24_Millis();

    while (true) {
        uint8_t status = RF24_UpdateStatus(radio);

        if ((status & RF24_STATUS_IRQ_MASK) != 0U) {
            return true;
        }

        if ((RF24_Millis() - start) > timeout_ms) {
#if RF24_FAILURE_HANDLING
            radio->failure_detected = true;
            radio->failure_recovery_attempts++;
#endif
            RF24_CE_Low();
            (void)RF24_FlushRx(radio);
            (void)RF24_FlushTx(radio);
            return false;
        }
    }
}

/* -------------------------------------------------------------------------- */
/* Public initialization                                                      */
/* -------------------------------------------------------------------------- */

void RF24_ResetObject(RF24_t *radio)
{
    if (radio == NULL) {
        return;
    }

    memset(radio, 0, sizeof(*radio));

    radio->spi_speed_hz = RF24_SPI_BAUDRATE_HZ;
    radio->payload_size = RF24_DEFAULT_PAYLOAD_SIZE;
    radio->address_width = RF24_DEFAULT_ADDRESS_WIDTH;
    radio->dynamic_payloads_enabled = false;
    radio->ack_payloads_enabled = false;
    radio->is_plus_variant = false;
    radio->pipe0_is_receiving = false;
    radio->tx_delay_us = 280U;
    radio->cs_delay_us = 5U;
}

bool RF24_Init(RF24_t *radio)
{
    uint8_t feature_before = 0U;
    uint8_t feature_after = 0U;
    uint8_t expected_config;
    uint8_t actual_config = 0U;

    if (radio == NULL) {
        PRINTF("RF24_Init FAIL: radio pointer is NULL\r\n");
        return false;
    }

    PRINTF("RF24_Init: ResetObject\r\n");
    RF24_ResetObject(radio);

    PRINTF("RF24_Init: PlatformInit\r\n");
    if (!RF24_PlatformInit(radio->spi_speed_hz)) {
        PRINTF("RF24_Init FAIL: PlatformInit\r\n");
        return false;
    }

    PRINTF("RF24_Init: CE LOW / CSN HIGH\r\n");
    RF24_CE_Low();
    RF24_CSN_High();
    RF24_DelayMs(5U);

    PRINTF("RF24_Init: SetRetries\r\n");
    if (!RF24_SetRetries(radio, RF24_DEFAULT_RETRY_DELAY, RF24_DEFAULT_RETRY_COUNT)) {
        PRINTF("RF24_Init FAIL: SetRetries\r\n");
        return false;
    }

    PRINTF("RF24_Init: SetDataRate\r\n");
    if (!RF24_SetDataRate(radio, RF24_DATA_RATE_1MBPS)) {
        PRINTF("RF24_Init FAIL: SetDataRate\r\n");
        return false;
    }

    PRINTF("RF24_Init: Read FEATURE before toggle\r\n");
    if (!RF24_ReadRegisterByte(radio, NRF24_FEATURE, &feature_before)) {
        PRINTF("RF24_Init FAIL: Read FEATURE before\r\n");
        return false;
    }
    PRINTF("FEATURE before = 0x%02X\r\n", feature_before);

    PRINTF("RF24_Init: ToggleFeatures\r\n");
    if (!RF24_ToggleFeatures(radio)) {
        PRINTF("RF24_Init FAIL: ToggleFeatures\r\n");
        return false;
    }

    PRINTF("RF24_Init: Read FEATURE after toggle\r\n");
    if (!RF24_ReadRegisterByte(radio, NRF24_FEATURE, &feature_after)) {
        PRINTF("RF24_Init FAIL: Read FEATURE after\r\n");
        return false;
    }
    PRINTF("FEATURE after = 0x%02X\r\n", feature_after);

    radio->is_plus_variant = (feature_before == feature_after);

    if (feature_after != 0U) {
        if (radio->is_plus_variant) {
            PRINTF("RF24_Init: ToggleFeatures second time\r\n");
            if (!RF24_ToggleFeatures(radio)) {
                PRINTF("RF24_Init FAIL: second ToggleFeatures\r\n");
                return false;
            }
        }

        PRINTF("RF24_Init: Clear FEATURE\r\n");
        if (!RF24_WriteRegisterByte(radio, NRF24_FEATURE, 0U)) {
            PRINTF("RF24_Init FAIL: clear FEATURE\r\n");
            return false;
        }
    }

    radio->ack_payloads_enabled = false;
    radio->dynamic_payloads_enabled = false;

    PRINTF("RF24_Init: Configure default registers\r\n");
    if (!RF24_WriteRegisterByte(radio, NRF24_DYNPD, 0U)) {
        PRINTF("RF24_Init FAIL: DYNPD\r\n");
        return false;
    }
    if (!RF24_WriteRegisterByte(radio, NRF24_EN_AA, 0x3FU)) {
        PRINTF("RF24_Init FAIL: EN_AA\r\n");
        return false;
    }
    if (!RF24_WriteRegisterByte(radio, NRF24_EN_RXADDR, 0x03U)) {
        PRINTF("RF24_Init FAIL: EN_RXADDR\r\n");
        return false;
    }

    PRINTF("RF24_Init: SetPayloadSize\r\n");
    if (!RF24_SetPayloadSize(radio, RF24_DEFAULT_PAYLOAD_SIZE)) {
        PRINTF("RF24_Init FAIL: SetPayloadSize\r\n");
        return false;
    }

    PRINTF("RF24_Init: SetAddressWidth\r\n");
    if (!RF24_SetAddressWidth(radio, RF24_DEFAULT_ADDRESS_WIDTH)) {
        PRINTF("RF24_Init FAIL: SetAddressWidth\r\n");
        return false;
    }

