Emanuel2023/EmanuelsProjects/MKL25Z4_Project_WirelessCountdownSystemProject/source/RF24.c
    PRINTF("RF24_Init: SetChannel\r\n");
    if (!RF24_SetChannel(radio, RF24_DEFAULT_CHANNEL)) {
        PRINTF("RF24_Init FAIL: SetChannel\r\n");
        return false;
    }

    PRINTF("RF24_Init: Clear status / flush FIFOs\r\n");
    (void)RF24_ClearStatusFlags(radio, RF24_IRQ_ALL);
    (void)RF24_FlushRx(radio);
    (void)RF24_FlushTx(radio);

    expected_config = (uint8_t)(
        RF24_BIT(NRF24_EN_CRC) |
        RF24_BIT(NRF24_CRCO) |
        RF24_BIT(NRF24_MASK_RX_DR) |
        RF24_BIT(NRF24_MASK_TX_DS) |
        RF24_BIT(NRF24_MASK_MAX_RT));

    PRINTF("RF24_Init: Write CONFIG = 0x%02X\r\n", expected_config);
    if (!RF24_WriteRegisterByte(radio, NRF24_CONFIG, expected_config)) {
        PRINTF("RF24_Init FAIL: write CONFIG\r\n");
        return false;
    }

    radio->config_register = expected_config;

    PRINTF("RF24_Init: PowerUp\r\n");
    if (!RF24_PowerUp(radio)) {
        PRINTF("RF24_Init FAIL: PowerUp\r\n");
        return false;
    }

    PRINTF("RF24_Init: Read CONFIG back\r\n");
    if (!RF24_ReadRegisterByte(radio, NRF24_CONFIG, &actual_config)) {
        PRINTF("RF24_Init FAIL: read CONFIG\r\n");
        return false;
    }

    expected_config |= RF24_BIT(NRF24_PWR_UP);

    PRINTF("CONFIG expected = 0x%02X\r\n", expected_config);
    PRINTF("CONFIG actual   = 0x%02X\r\n", actual_config);

    if (actual_config != expected_config) {
        PRINTF("RF24_Init FAIL: CONFIG mismatch\r\n");
        return false;
    }

    PRINTF("RF24_Init SUCCESS\r\n");
    return true;
}

bool RF24_IsChipConnected(RF24_t *radio)
{
    uint8_t setup_aw = 0U;

    if ((radio == NULL) ||
        !RF24_ReadRegisterByte(radio, NRF24_SETUP_AW, &setup_aw)) {
        return false;
    }

    return setup_aw == (uint8_t)(radio->address_width - 2U);
}

/* -------------------------------------------------------------------------- */
/* Basic register/status operations                                           */
/* -------------------------------------------------------------------------- */

uint8_t RF24_UpdateStatus(RF24_t *radio)
{
    if (radio == NULL) {
        return 0xFFU;
    }

    (void)RF24_Command(radio, NRF24_NOP);
    return radio->status;
}

uint8_t RF24_GetStatus(const RF24_t *radio)
{
    return (radio != NULL) ? radio->status : 0xFFU;
}

uint8_t RF24_ClearStatusFlags(RF24_t *radio, uint8_t flags)
{
    if (radio == NULL) {
        return 0xFFU;
    }

    (void)RF24_WriteRegisterByte(
        radio,
        NRF24_STATUS,
        (uint8_t)(flags & RF24_IRQ_ALL));

    return radio->status;
}

bool RF24_SetStatusFlags(RF24_t *radio, uint8_t flags)
{
    uint8_t config;

    if (radio == NULL) {
        return false;
    }

    config = (uint8_t)(
        (radio->config_register & (uint8_t)~RF24_IRQ_ALL) |
        ((uint8_t)~flags & RF24_IRQ_ALL));

    if (!RF24_WriteRegisterByte(radio, NRF24_CONFIG, config)) {
        return false;
    }

    radio->config_register = config;
    return true;
}

bool RF24_FlushRx(RF24_t *radio)
{
    return RF24_Command(radio, NRF24_FLUSH_RX);
}

bool RF24_FlushTx(RF24_t *radio)
{
    return RF24_Command(radio, NRF24_FLUSH_TX);
}

/* -------------------------------------------------------------------------- */
/* Configuration                                                              */
/* -------------------------------------------------------------------------- */

bool RF24_SetChannel(RF24_t *radio, uint8_t channel)
{
    return RF24_WriteRegisterByte(
        radio,
        NRF24_RF_CH,
        RF24_MIN(channel, RF24_MAX_CHANNEL));
}

uint8_t RF24_GetChannel(RF24_t *radio)
{
    uint8_t channel = 0U;
    (void)RF24_ReadRegisterByte(radio, NRF24_RF_CH, &channel);
    return channel;
}

bool RF24_SetPayloadSize(RF24_t *radio, uint8_t size)
{
    if (radio == NULL) {
        return false;
    }

    size = RF24_MAX(1U, RF24_MIN(size, RF24_MAX_PAYLOAD_SIZE));
    radio->payload_size = size;

    for (uint8_t pipe = 0U; pipe < 6U; ++pipe) {
        if (!RF24_WriteRegisterByte(
                radio,
                s_child_payload_size[pipe],
                size)) {
            return false;
        }
    }

    return true;
}

uint8_t RF24_GetPayloadSize(const RF24_t *radio)
{
    return (radio != NULL) ? radio->payload_size : 0U;
}

bool RF24_SetAddressWidth(RF24_t *radio, uint8_t width)
{
    if (radio == NULL) {
        return false;
    }

    width = RF24_MAX(3U, RF24_MIN(width, 5U));

    if (!RF24_WriteRegisterByte(
            radio,
            NRF24_SETUP_AW,
            (uint8_t)(width - 2U))) {
        return false;
    }

    radio->address_width = width;
    return true;
}

bool RF24_SetRetries(RF24_t *radio, uint8_t delay, uint8_t count)
{
    uint8_t value =
        (uint8_t)(((delay & 0x0FU) << NRF24_ARD) |
                  ((count & 0x0FU) << NRF24_ARC));

    return RF24_WriteRegisterByte(radio, NRF24_SETUP_RETR, value);
}

bool RF24_SetDataRate(RF24_t *radio, RF24_DataRate_t speed)
{
    uint8_t setup = 0U;
    uint8_t verify = 0U;

    if ((radio == NULL) ||
        !RF24_ReadRegisterByte(radio, NRF24_RF_SETUP, &setup)) {
        return false;
    }

    setup &= (uint8_t)~(
        RF24_BIT(NRF24_RF_DR_LOW) |
        RF24_BIT(NRF24_RF_DR_HIGH));

    setup |= RF24_GetDataRateRegisterValue(speed);

    if (!RF24_WriteRegisterByte(radio, NRF24_RF_SETUP, setup) ||
        !RF24_ReadRegisterByte(radio, NRF24_RF_SETUP, &verify)) {
        return false;
    }

    switch (speed) {
        case RF24_DATA_RATE_250KBPS:
            radio->tx_delay_us = 505U;
            break;

        case RF24_DATA_RATE_2MBPS:
            radio->tx_delay_us = 240U;
            break;

        case RF24_DATA_RATE_1MBPS:
        default:
            radio->tx_delay_us = 280U;
            break;
    }

    return verify == setup;
}

RF24_DataRate_t RF24_GetDataRate(RF24_t *radio)
{
    uint8_t setup = 0U;

    if ((radio == NULL) ||
        !RF24_ReadRegisterByte(radio, NRF24_RF_SETUP, &setup)) {
        return RF24_DATA_RATE_1MBPS;
    }

    if ((setup & RF24_BIT(NRF24_RF_DR_LOW)) != 0U) {
        return RF24_DATA_RATE_250KBPS;
    }

    if ((setup & RF24_BIT(NRF24_RF_DR_HIGH)) != 0U) {
        return RF24_DATA_RATE_2MBPS;
    }

