Emanuel2023/EmanuelsProjects/MKL25Z4_Project_WirelessCountdownSystemProject/source/RF24.c
    return RF24_DATA_RATE_1MBPS;
}

bool RF24_SetPALevel(
    RF24_t *radio,
    RF24_PALevel_t level,
    bool lna_enable)
{
    uint8_t setup = 0U;

    if ((radio == NULL) ||
        !RF24_ReadRegisterByte(radio, NRF24_RF_SETUP, &setup)) {
        return false;
    }

    setup &= (uint8_t)~(
        RF24_BIT(NRF24_RF_PWR_LOW) |
        RF24_BIT(NRF24_RF_PWR_HIGH) |
        RF24_BIT(NRF24_LNA_HCURR));

    setup |= RF24_GetPALevelRegisterValue(level, lna_enable);

    return RF24_WriteRegisterByte(radio, NRF24_RF_SETUP, setup);
}

RF24_PALevel_t RF24_GetPALevel(RF24_t *radio)
{
    uint8_t setup = 0U;
    uint8_t level_bits;

    if ((radio == NULL) ||
        !RF24_ReadRegisterByte(radio, NRF24_RF_SETUP, &setup)) {
        return RF24_PA_MIN;
    }

    level_bits = (uint8_t)(
        setup &
        (RF24_BIT(NRF24_RF_PWR_LOW) |
         RF24_BIT(NRF24_RF_PWR_HIGH)));

    if (level_bits ==
        (RF24_BIT(NRF24_RF_PWR_LOW) |
         RF24_BIT(NRF24_RF_PWR_HIGH))) {
        return RF24_PA_MAX;
    }

    if (level_bits == RF24_BIT(NRF24_RF_PWR_HIGH)) {
        return RF24_PA_HIGH;
    }

    if (level_bits == RF24_BIT(NRF24_RF_PWR_LOW)) {
        return RF24_PA_LOW;
    }

    return RF24_PA_MIN;
}

bool RF24_SetAutoAck(RF24_t *radio, bool enable)
{
    return RF24_WriteRegisterByte(
        radio,
        NRF24_EN_AA,
        enable ? 0x3FU : 0U);
}

bool RF24_SetAutoAckPipe(
    RF24_t *radio,
    uint8_t pipe,
    bool enable)
{
    uint8_t en_aa = 0U;

    if ((radio == NULL) || (pipe > 5U) ||
        !RF24_ReadRegisterByte(radio, NRF24_EN_AA, &en_aa)) {
        return false;
    }

    if (enable) {
        en_aa |= RF24_BIT(pipe);
    } else {
        en_aa &= (uint8_t)~RF24_BIT(pipe);
    }

    return RF24_WriteRegisterByte(radio, NRF24_EN_AA, en_aa);
}

bool RF24_EnableDynamicPayloads(RF24_t *radio)
{
    uint8_t feature = 0U;

    if ((radio == NULL) ||
        !RF24_ReadRegisterByte(radio, NRF24_FEATURE, &feature)) {
        return false;
    }

    feature |= RF24_BIT(NRF24_EN_DPL);

    if (!RF24_WriteRegisterByte(radio, NRF24_FEATURE, feature) ||
        !RF24_WriteRegisterByte(radio, NRF24_DYNPD, 0x3FU)) {
        return false;
    }

    radio->dynamic_payloads_enabled = true;
    return true;
}

bool RF24_DisableDynamicPayloads(RF24_t *radio)
{
    uint8_t feature = 0U;

    if ((radio == NULL) ||
        !RF24_ReadRegisterByte(radio, NRF24_FEATURE, &feature)) {
        return false;
    }

    feature &= (uint8_t)~RF24_BIT(NRF24_EN_DPL);

    if (!RF24_WriteRegisterByte(radio, NRF24_FEATURE, feature) ||
        !RF24_WriteRegisterByte(radio, NRF24_DYNPD, 0U)) {
        return false;
    }

    radio->dynamic_payloads_enabled = false;
    return true;
}

bool RF24_EnableAckPayload(RF24_t *radio)
{
    uint8_t feature = 0U;
    uint8_t dynpd = 0U;

    if ((radio == NULL) ||
        !RF24_ReadRegisterByte(radio, NRF24_FEATURE, &feature) ||
        !RF24_ReadRegisterByte(radio, NRF24_DYNPD, &dynpd)) {
        return false;
    }

    feature |= (uint8_t)(
        RF24_BIT(NRF24_EN_ACK_PAY) |
        RF24_BIT(NRF24_EN_DPL));

    dynpd |= (uint8_t)(
        RF24_BIT(NRF24_DPL_P0) |
        RF24_BIT(NRF24_DPL_P1));

    if (!RF24_WriteRegisterByte(radio, NRF24_FEATURE, feature) ||
        !RF24_WriteRegisterByte(radio, NRF24_DYNPD, dynpd)) {
        return false;
    }

    radio->ack_payloads_enabled = true;
    radio->dynamic_payloads_enabled = true;
    return true;
}

bool RF24_DisableAckPayload(RF24_t *radio)
{
    uint8_t feature = 0U;

    if ((radio == NULL) ||
        !RF24_ReadRegisterByte(radio, NRF24_FEATURE, &feature)) {
        return false;
    }

    feature &= (uint8_t)~RF24_BIT(NRF24_EN_ACK_PAY);

    if (!RF24_WriteRegisterByte(radio, NRF24_FEATURE, feature)) {
        return false;
    }

    radio->ack_payloads_enabled = false;
    return true;
}

bool RF24_EnableDynamicAck(RF24_t *radio)
{
    uint8_t feature = 0U;

    if ((radio == NULL) ||
        !RF24_ReadRegisterByte(radio, NRF24_FEATURE, &feature)) {
        return false;
    }

    feature |= RF24_BIT(NRF24_EN_DYN_ACK);

    return RF24_WriteRegisterByte(radio, NRF24_FEATURE, feature);
}

/* -------------------------------------------------------------------------- */
/* Addressing                                                                 */
/* -------------------------------------------------------------------------- */

bool RF24_OpenWritingPipe(
    RF24_t *radio,
    const uint8_t *address)
{
    if ((radio == NULL) || (address == NULL)) {
        return false;
    }

    memcpy(
        radio->pipe0_writing_address,
        address,
        radio->address_width);

    return RF24_WriteRegisterBuffer(
               radio,
               NRF24_RX_ADDR_P0,
               address,
               radio->address_width) &&
           RF24_WriteRegisterBuffer(
               radio,
               NRF24_TX_ADDR,
               address,
               radio->address_width);
}

bool RF24_OpenReadingPipe(
    RF24_t *radio,
    uint8_t pipe,
    const uint8_t *address)
{
    uint8_t en_rxaddr = 0U;

    if ((radio == NULL) ||
        (address == NULL) ||
        (pipe > 5U)) {
        return false;
    }

    if (pipe == 0U) {
        memcpy(
            radio->pipe0_reading_address,
            address,
            radio->address_width);
        radio->pipe0_is_receiving = true;
    }

    if (pipe < 2U) {
        if (!RF24_WriteRegisterBuffer(
                radio,
                s_child_pipe_address[pipe],
                address,
                radio->address_width)) {
            return false;
        }
    } else {
        if (!RF24_WriteRegisterByte(
                radio,
                s_child_pipe_address[pipe],
                address[0])) {
            return false;
        }
    }

    if (!RF24_WriteRegisterByte(
            radio,
            s_child_payload_size[pipe],
            radio->payload_size) ||
        !RF24_ReadRegisterByte(
            radio,
            NRF24_EN_RXADDR,
            &en_rxaddr)) {
        return false;
    }

    en_rxaddr |= RF24_BIT(s_child_pipe_enable[pipe]);

    return RF24_WriteRegisterByte(
        radio,
        NRF24_EN_RXADDR,
        en_rxaddr);
}

bool RF24_CloseReadingPipe(RF24_t *radio, uint8_t pipe)
{
    uint8_t en_rxaddr = 0U;

