Emanuel2023/EmanuelsProjects/MKL25Z4_Project_WirelessCountdownSystemProject/source/RF24.c
    return true;
}

bool RF24_WriteAckPayload(
    RF24_t *radio,
    uint8_t pipe,
    const void *buffer,
    uint8_t length)
{
    if ((radio == NULL) ||
        (pipe > 5U) ||
        !radio->ack_payloads_enabled) {
        return false;
    }

    return RF24_WritePayloadInternal(
        radio,
        buffer,
        length,
        (uint8_t)(NRF24_W_ACK_PAYLOAD | (pipe & 0x07U)));
}

bool RF24_RxFifoFull(RF24_t *radio)
{
    uint8_t fifo = 0U;

    if ((radio == NULL) ||
        !RF24_ReadRegisterByte(
            radio,
            NRF24_FIFO_STATUS,
            &fifo)) {
        return false;
    }

    return (fifo & RF24_BIT(NRF24_RX_FULL)) != 0U;
}

RF24_FifoState_t RF24_GetFifoState(
    RF24_t *radio,
    bool tx_fifo)
{
    uint8_t fifo = 0U;
    bool full;
    bool empty;

    if ((radio == NULL) ||
        !RF24_ReadRegisterByte(
            radio,
            NRF24_FIFO_STATUS,
            &fifo)) {
        return RF24_FIFO_INVALID;
    }

    if (tx_fifo) {
        full = (fifo & RF24_BIT(NRF24_FIFO_FULL)) != 0U;
        empty = (fifo & RF24_BIT(NRF24_TX_EMPTY)) != 0U;
    } else {
        full = (fifo & RF24_BIT(NRF24_RX_FULL)) != 0U;
        empty = (fifo & RF24_BIT(NRF24_RX_EMPTY)) != 0U;
    }

    if (full && empty) {
        return RF24_FIFO_INVALID;
    }

    if (full) {
        return RF24_FIFO_FULL;
    }

    if (empty) {
        return RF24_FIFO_EMPTY;
    }

    return RF24_FIFO_OCCUPIED;
}

/* -------------------------------------------------------------------------- */
/* Carrier detection and diagnostics                                          */
/* -------------------------------------------------------------------------- */

bool RF24_TestCarrier(RF24_t *radio)
{
    uint8_t rpd = 0U;

    if ((radio == NULL) ||
        !RF24_ReadRegisterByte(radio, NRF24_RPD, &rpd)) {
        return false;
    }

    return (rpd & 0x01U) != 0U;
}

bool RF24_IsPlusVariant(const RF24_t *radio)
{
    return (radio != NULL) && radio->is_plus_variant;
}

uint8_t RF24_GetARC(RF24_t *radio)
{
    uint8_t observe = 0U;

    if ((radio == NULL) ||
        !RF24_ReadRegisterByte(
            radio,
            NRF24_OBSERVE_TX,
            &observe)) {
        return 0U;
    }

    return (uint8_t)(observe & 0x0FU);
}
